# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [1]:
pip install pandas==1.5.0

Requirement already satisfied: pandas==1.5.0 in /Users/mac/anaconda3/envs/nahuelito/lib/python3.9/site-packages (1.5.0)
Requirement already satisfied: python-dateutil>=2.8.1 in /Users/mac/anaconda3/envs/nahuelito/lib/python3.9/site-packages (from pandas==1.5.0) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/mac/anaconda3/envs/nahuelito/lib/python3.9/site-packages (from pandas==1.5.0) (2023.3.post1)
Requirement already satisfied: numpy>=1.20.3 in /Users/mac/anaconda3/envs/nahuelito/lib/python3.9/site-packages (from pandas==1.5.0) (1.26.1)
Requirement already satisfied: six>=1.5 in /Users/mac/anaconda3/envs/nahuelito/lib/python3.9/site-packages (from python-dateutil>=2.8.1->pandas==1.5.0) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

print(pd.__version__)

1.5.0

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [3]:
employee = pd.read_csv('Employee.csv')
employee.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

In [4]:
# Method 1 using groupby:

# Calculate the mean salary by department using groupby

mean_salary_by_department_groupby = employee.groupby('Department')['Salary'].mean()
mean_salary_by_department_groupby

Department
HR       45.00
IT       48.75
Sales    55.00
Name: Salary, dtype: float64

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

In [5]:
# Method 2 using pivot_table:

# Calculate the mean salary by department using pivot_table

mean_salary_by_department_pivot = pd.pivot_table(employee, values='Salary', index='Department', aggfunc='mean')
mean_salary_by_department_pivot

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

In [6]:
# Use pivot_table to select the mean salary by department and title

mean_salary_by_department_and_title = pd.pivot_table(employee, values='Salary', index=['Department', 'Title'], aggfunc='mean')
mean_salary_by_department_and_title

                      Salary
Department Title
HR         VP           70.0
           analyst      32.5
IT         VP           70.0
           analyst      32.5
           associate    60.0
Sales      associate    55.0

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [7]:
mean_salary_and_years_by_title = pd.pivot_table(employee, values=['Salary', 'Years'], index='Title', aggfunc={'Salary': 'mean', 'Years': 'mean'})
mean_salary_and_years_by_title

              Salary  Years
Title
VP         70.000000   8.00
analyst    32.500000   2.25
associate  56.666667   4.00

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [8]:
salary_and_employee_count_by_department_and_title = pd.pivot_table(employee, values=['Salary'], index=['Department', 'Title'], aggfunc={'Salary': ['mean', 'count']})
salary_and_employee_count_by_department_and_title

                     Salary
                      count  mean
Department Title
HR         VP             1  70.0
           analyst        2  32.5
IT         VP             1  70.0
           analyst        2  32.5
           associate      1  60.0
Sales      associate      2  55.0

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [9]:
salary_stats = pd.pivot_table(employee, 
                              values='Salary', 
                              index=['Department', 'Title'], 
                              aggfunc=['median', 'min', 'max', 'std'])

salary_stats

                     median    min    max       std
                     Salary Salary Salary    Salary
Department Title
HR         VP          70.0     70     70       NaN
           analyst     32.5     30     35  3.535534
IT         VP          70.0     70     70       NaN
           analyst     32.5     30     35  3.535534
           associate   60.0     60     60       NaN
Sales      associate   55.0     55     55  0.000000

**Commented Results:**

- The HR and IT departments have job titles with the same median, minimum, and maximum salaries, suggesting a lack of salary variability within these departments.
- The "associate" job title in both the IT and Sales departments also shows no salary variability with a standard deviation of 0.
- It's possible that there are unique circumstances or data limitations leading to these patterns, such as small sample sizes or fixed salary structures.

These insights can help identify areas where further investigation or data collection may be necessary to gain a better understanding of salary distributions within each department and job title.

#### Based on your comments, fill the missing values with an appropriate value.

In [10]:
salary_stats.fillna(0, inplace=True)
salary_stats

                     median    min    max       std
                     Salary Salary Salary    Salary
Department Title
HR         VP          70.0     70     70  0.000000
           analyst     32.5     30     35  3.535534
IT         VP          70.0     70     70  0.000000
           analyst     32.5     30     35  3.535534
           associate   60.0     60     60  0.000000
Sales      associate   55.0     55     55  0.000000

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [11]:
department_stats = pd.pivot_table(employee, 
                                  values=['Name', 'Salary'], 
                                  index='Department', 
                                  aggfunc={'Name': 'count', 'Salary': 'sum'})

department_stats

            Name  Salary
Department
HR             3     135
IT             4     195
Sales          2     110

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [12]:
experience_salary_stats = pd.pivot_table(employee, 
                                         values=['Years', 'Salary'], 
                                         index=['Department', 'Title'], 
                                         aggfunc={'Years': 'sum', 'Salary': 'mean'})

experience_salary_stats

                      Salary  Years
Department Title
HR         VP           70.0      8
           analyst      32.5      6
IT         VP           70.0      8
           analyst      32.5      3
           associate    60.0      7
Sales      associate    55.0      5

### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table.

Hint: Write a custom function.

In [13]:
# Define a function to calculate mean salary after removing max

def mean_after_removing_max(group):
    max_salary = group['Salary'].max()  # Find the maximum salary in the group
    group_without_max = group[group['Salary'] < max_salary]  # Remove max salary
    return group_without_max['Salary'].mean()  # Calculate mean for the group


# Apply the function to each department

department_mean_salary = employee.groupby('Department').apply(mean_after_removing_max)


# Create a pivot table for the results

pivot_table = pd.DataFrame({'Mean Salary After Removing Max': department_mean_salary})


# Display the pivot_table

pivot_table

            Mean Salary After Removing Max
Department
HR                               32.500000
IT                               41.666667
Sales                                  NaN